---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LinearFramingLength
source: html/53e40572-3f11-79b5-70a1-2cd0c844c091.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LinearFramingLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId LinearFramingLength { get; }
```